/*
    Од тастатура се внесуваат цели броеви се додека не се внесе нешто што не е цел број.

    Да се испечати на екран сумата на броевите во кои цифрите се подредени во опаѓачки редослед. Доколку нема
    такви броеви, да се испечати порака NEMA.

    Објаснување на примерот:

    Во првиот пример, нема ниту еден број во кој цифрите се подредени во опаѓачки редослед, па се печати NEMA.

    Во вториот пример, во 4321, 21 и 81, цифрите се подредени во опаѓачки редослед, па се печати нивната сума 4423.
*/

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main(){
    int n, sum = 0;
    int flg;
    int rez;
    int temp1;
    int temp2;

    while(scanf("%d", &n)){
        flg = 1;
        temp1 = n;
        temp2 = n % 10;
        temp1 /= 10;
        while(temp1 > 0){
            if((temp1 % 10 > temp2)==0){
                flg = 0;
                break;
            }
            temp2 = temp1 % 10;
            temp1 /= 10;
        }
        if(flg == 1){
            sum += n;
        }
    }

    if(sum == 0){
        printf("NEMA");
    } else {
        printf("%d", sum);
    }

    return 0;
}