/*
    Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна
    матрица од цели броеви, која се чита во продолжение. Да се напише програма која
    за таа матрица(макс. 100 x 100) ќе ја испечати должината на најдолгата строго
    растечка подниза, доколку матрицата ја гледаме ред по ред.

    На пример, ако е дадена следната матрица:

    1 2 3 9 8
    5 5 5 5 5
    0 1 2 0 0
    9 1 2 3 4
    1 1 1 1 1

    должината на најдолгата строго растечка подниза е 4, а тоа е должината на
    1 2 3 4, во четвртиот ред.

    For example:

    Input
    2
    1 2
    2 1

    Result
    2
*/

#include <stdio.h>
#include <stdlib.h>
#define MAX 100

int main(){
    int a[MAX][MAX];
    int N;
    int i,j;

    scanf("%d", &N);
    for(i =0; i< N; i++){
        for(j=0;j<N;j++){
            scanf("%d",&a[i][j]);
        }
    }

    int counter;
    int max = 0;
    for(i = 0; i < N; i++ ){
        counter = 0;
        for(j = 0; j < N; j++){
            if(a[i][j] < a[i][j+1]){
                counter++;
            }
        }
        if(max < counter){
           max = counter;
        }
    }

    printf("%d", max + 1);
}
