/*
    Полу-елка се црта со ѕвездички (*) и прачки (|) на следниот начин:

    *
    |
    |**
    |
    |***
    |
    |****

    Значи, во првиот ред има ѕвездичка. Во следниот ред има прачка. Понатаму преку еден ред имаме
    или само прачка или прачка со неколку ѕвездички (една повеќе отколку во прет-претходниот ред).
    Полу-елката завршува со ред во кој има една прачка и N ѕвездички.

    За дадено N, отпечатете ја полу-елката според описот.

    За N=4, треба на излез да се добие како примерот погоре.
*/

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main(){
    int i, j;
    int n;
    scanf("%d", &n);
    printf("*\n");

    for(i=2; i<=n; i++){
        printf("| \n");
        printf("|");
        for(j=1; j<=i; d++){
            printf("*");
        }
        printf("\n");
    }

    return 0;
}