/*
    Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:

    - индекс (шестцифрен цел број)
    - шест оценки од последниот семестар кој го слушал

    Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот:

    - просек на студентот
        - просекот да се испечати со точност од 3 децимали
    - година на студии
        - студентите чијшто индекс почнува на 21 се втора година, 20 се трета година, 19 се четврта година итн.
    - дали е награден (1 = награден, 0 = не е награден)
        - Еден студент се наградува доколку има просек еднаков или поголем од 9.5
*/
#include <stdio.h>

int main(){
    int indeks;
    int p1,p2,p3,p4,p5,p6;
    float prosek;
    int godina;
    int ucebnaGodina = 23;

    scanf("%d", &indeks);
    scanf("%d %d %d %d %d %d", &p1, &p2, &p3, &p4, &p5, &p6);

    prosek = (p1+p2+p3 +p4+p5+p6)/6.0;

    printf("Prosek: %.3f \n", prosek);
    printf("Student: %d \n", indeks);

    godina = ucebnaGodina - (indeks/10000);

    printf("%d godina \n", godina);

    if(prosek >= 9.5){
        printf("Nagraden: 1 \n");
    } else {
        printf("Nagraden: 0 \n");
    }
    return 0;
}